#!/usr/bin/env python
# -*- coding: utf-8 -*-

import argparse
import shelve

import ankigreekutil as anki


WIKTIONARY = 'http://en.wiktionary.org/wiki/'
REPRESENTATIONS = {'imperfect': '----    |',
                   'present': '--|--',
                   'future': '|    -\n|    -----',
                   'perfect': '----|',
                   'pluperfect': '----X    |',
                   'aorist': '-   |',
                   'future perfect': '|    ----    X',
                   'indicative': '👉 ',
                   'imperative': '✋ ',
                   'subjunctive': '👇 ',
                   'optative': '👻 ',
                   'first singular': '(👤 )',
                   'second singular': '→ 👤 ',
                   'third singular': '👤 ',
                   'first dual': '(👬 )',
                   'second dual': '→ 👬 ',
                   'third dual': '👬 ',
                   'first plural': '(👪 )',
                   'second plural': '→ 👪 ',
                   'third plural': '👪 ',
                   'infinitive': '∞',
                   'active': '🏃 ',
                   'middle': '🔁 ',
                   'passive': '☔️ '
                   }
VOICE = ['active', 'middle', 'passive']
MOOD = ['indicative', 'subjunctive', 'optative', 'imperative']
TENSE = ['present', 'imperfect', 'future', '1st aorist', '2nd aorist',
         '1st perfect', '2nd perfect', '1st pluperfect', '2nd pluperfect',
         'future perfect']
PERSON = ['1st', '2nd', '3rd', '2nd dual', '3rd dual', '1st plural',
          '2nd plural', '3rd plural']
GENDER = ['m', 'f', 'n']
CASE = ['nominative', 'vocative', 'genitive', 'dative', 'accusative']


def set_verb_form(verb, voice, mood, tense, forms):
    if not verb.get(voice):
        verb[voice] = {}
    if not verb[voice].get(mood):
        verb[voice][mood] = {}
    if not verb[voice][mood].get(tense):
        verb[voice][mood][tense] = {}

    if mood == 'infinitive':
        verb[voice][mood][tense] = forms
        return

    if mood == 'participle':
        part_cases = {'singular': ['nominative', 'genitive', 'dative',
                                   'accusative', 'vocative'],
                      'dual':     ['nominative', 'genitive'],
                      'plural':   ['nominative', 'genitive', 'dative',
                                   'accusative']}

        for number in ['singular', 'dual', 'plural']:
            for ii, cc in enumerate(part_cases[number]):
                verb[voice][mood][tense][cc] = {}
                for jj, gg in enumerate(GENDER):
                    verb[voice][mood][tense][cc][gg] = forms[ii][jj]
                if number == 'dual':
                    nom = verb[voice][mood][tense]['nominative']
                    verb[voice][mood][tense]['vocative'] = nom
                    verb[voice][mood][tense]['accusative'] = nom
                    gen = verb[voice][mood][tense]['genitive']
                    verb[voice][mood][tense]['dative'] = gen
                if number == 'plural':
                    nom = verb[voice][mood][tense]['nominative']
                    verb[voice][mood][tense]['vocative'] = nom
        return

    for ii in range(0, len(PERSON)):
        verb[voice][mood][tense][PERSON[ii]] = forms[ii]


def prepare_shelf():
    luo = {}

    # Active
    set_verb_form(luo, 'active', 'indicative', 'present',
                  ['λύ̄ω', 'λύ̄εις', 'λύ̄ει', 'λύ̄ετον', 'λύ̄ετον',
                   'λύ̄ομεν', 'λύ̄ετε', 'λύ̄ουσι'])
    set_verb_form(luo, 'active', 'indicative', 'imperfect',
                  ['ἔλῡον', 'ἔλῡες', 'ἔλῡε', 'ἐλύ̄ετον', 'ἐλῡέτην', 'ἐλύ̄ομεν',
                   'ἐλύ̄ετε', 'ἔλῡον'])
    set_verb_form(luo, 'active', 'indicative', 'future',
                  ['λύ̄σω', 'λύ̄σεις', 'λύ̄σει', 'λύ̄σετον', 'λύ̄σετον',
                   'λύ̄σομεν', 'λύ̄σετε', 'λύ̄σουσι'])
    set_verb_form(luo, 'active', 'subjunctive', 'present',
                  ['λύ̄ω', 'λύ̄ῃς', 'λύ̄ῃ', 'λύ̄ητον', 'λύ̄ητον', 'λύ̄ωμεν',
                   'λύ̄ητε', 'λύ̄ωσι'])
    set_verb_form(luo, 'active', 'optative', 'present',
                  ['λύ̄οιμι', 'λύ̄οις', 'λύ̄οι', 'λύ̄οιτον', 'λῡοίτην',
                   'λύ̄οιμεν', 'λύ̄οιτε', 'λύ̄οιεν'])
    set_verb_form(luo, 'active', 'optative', 'future',
                  ['λύ̄σοιμι', 'λύ̄σοις', 'λύ̄σοι', 'λύ̄σοιτον', 'λῡσοίτην',
                   'λύ̄σοιμεν', 'λύ̄σοιτε', 'λύ̄σοιεν'])
    set_verb_form(luo, 'active', 'imperative', 'present',
                  ['', 'λῦε', 'λῡέτω', 'λύ̄ετον', 'λῡέτων', '', 'λύ̄ετε',
                   'λῡόντων'])
    set_verb_form(luo, 'active', 'infinitive', 'present', 'λύ̄ειν')
    set_verb_form(luo, 'active', 'infinitive', 'future', 'λύ̄σειν')

    set_verb_form(luo, 'active', 'participle', 'present',
                  [['λύ̄ων', 'λύ̄ουσα', 'λῦον'],
                   ['λύ̄οντος', 'λῡούσης', 'λύ̄οντος'],
                   ['λύ̄οντι', 'λῡούσῃ', 'λύ̄οντι'],
                   ['λύ̄οντα', 'λύ̄ουσαν', 'λῦον'],
                   ['λύ̄ων', 'λύ̄ουσα', 'λῦον'],
                   ['λύ̄οντε', 'λῡούσᾱ', 'λύ̄οντε'],
                   ['λῡόντοιν', 'λῡούσαιν', 'λῡόντοιν'],
                   ['λύ̄οντες', 'λύ̄ουσαι', 'λύ̄οντα'],
                   ['λῡόντων', 'λῡουσῶν', 'λῡόντων'],
                   ['λύ̄ουσι(ν)', 'λῡούσαις', 'λύ̄ουσι(ν)'],
                   ['λύ̄οντας', 'λῡούσᾱς', 'λύ̄οντα']])

    set_verb_form(luo, 'active', 'participle', 'future',
                  [['λύ̄σων', 'λύ̄σουσα', 'λῦσον'],
                   ['λύ̄σοντος', 'λῡσούσης', 'λύ̄σοντος'],
                   ['λύ̄σοντι', 'λῡσούσῃ', 'λύ̄σοντι'],
                   ['λύ̄σοντα', 'λύ̄σουσαν', 'λῦσον'],
                   ['λύ̄σων', 'λύ̄σουσα', 'λῦσον'],
                   ['λύ̄σοντε', 'λῡσούσᾱ', 'λύ̄σοντε'],
                   ['λῡσόντοιν', 'λῡσούσαιν', 'λῡσόντοιν'],
                   ['λύ̄σοντες', 'λύ̄σουσαι', 'λύ̄σοντα'],
                   ['λῡσόντων', 'λῡσουσῶν', 'λῡσόντων'],
                   ['λύ̄σουσι(ν)', 'λῡσούσαις', 'λύ̄σουσι(ν)'],
                   ['λύ̄σοντας', 'λῡσούσᾱς', 'λύ̄σοντα']])

    set_verb_form(luo, 'active', 'indicative', '1st aorist',
                  ['ἔλῡσα', 'ἔλῡσας', 'ἔλῡσε', 'ἐλύ̄σατον', 'ἐλῡσάτην',
                   'ἐλύ̄σαμεν', 'ἐλύ̄σατε', 'ἔλῡσαν'])
    set_verb_form(luo, 'active', 'indicative', '1st perfect',
                  ['λέλυκα', 'λέλυκας', 'λέλυκε', 'λελύκατον', 'λελύκατον',
                   'λελύκαμεν', 'λελύκατε', 'λελύκᾱσι'])
    set_verb_form(luo, 'active', 'indicative', '1st pluperfect',
                  ['ἐλελύκη', 'ἐλελύκης', 'ἐλελύκει(ν)', 'ἐλελύκετον',
                   'ἐλελυκέτην', 'ἐλελύκεμεν', 'ἐλελύκετε', 'ἐλελύκεσαν'])

    set_verb_form(luo, 'active', 'subjunctive', '1st aorist',
                  ['λύ̄σω', 'λύ̄σῃς', 'λύ̄σῃ', 'λύ̄σητον', 'λύ̄σητον',
                   'λύ̄σωμεν', 'λύ̄σητε', 'λύ̄σωσι'])

    set_verb_form(luo, 'active', 'subjunctive', '1st perfect',
                  ['λελυκὼς ὦ / λελύκω', 'λελυκὼς ᾖς / λελύκῃς',
                   'λελυκὼς ᾖ / λελύκῃ', 'λελυκότε ἦτον / λελύκητον',
                   'λελυκότε ἦτον / λελύκητον', 'λελυκότες ὦμεν / λελύκωμεν',
                   'λελυκότες ἦτε / λελύκητε', 'λελυκότες ὦσι / λελύκωσι'])

    set_verb_form(luo, 'active', 'optative', '1st aorist',
                  ['λύ̄σαιμι', 'λύ̄σαις / λύ̄σειας', 'λύ̄σαι / λύ̄σειε',
                   'λύ̄σαιτον', 'λῡσαίτην', 'λύ̄σαιμεν', 'λύ̄σαιτε',
                   'λύ̄σαιεν, λύ̄σειαν'])

    set_verb_form(luo, 'active', 'optative', '1st perfect',
                  ['λελυκὼς εἴην / λελύκοιμι / λελύκοίην',
                   'λελυκὼς εἴης / λελύκοις / λελύκοίης',
                   'λελυκὼς εἴη / λελύκοι / λελύκοίη',
                   'λελυκότε εἴητον / λελυκότε εἶτον / λελύκοιτον',
                   'λελυκότε εἰήτην / λελυκότε εἴτην / λελυκοίτην',
                   'λελυκότες εἴημεν / λελυκότες εἶμεν / λελύκοιμεν',
                   'λελυκότες εἴητε / λελυκότες εἶτε / λελύκοιτε',
                   'λελυκότες εἴησαν / λελυκότες εἶεν / λελύκοιεν'])

    set_verb_form(luo, 'active', 'aorist', '1st aorist',
                  ['', 'λῦσον', 'λῡσάτω', 'λύ̄σατον', 'λῡσάτων', '',
                   'λύ̄σατε', 'λῡσάντων'])

    set_verb_form(luo, 'active', 'aorist', '1st perfect',
                  ['', 'λελυκὼς ἴσθι / λέλυκε', 'λελυκὼς ἔστω / λελυκέτω',
                   'λελυκότε ἔστον / λελύκετον',
                   'λελυκότε ἔστων / λελυκέτων', '',
                   'λελυκότες ἐστέ / λελύκετε', 'λελυκότες ὄντων'])

    set_verb_form(luo, 'active', 'infinitive', '1st aorist', 'λῦσαι')
    set_verb_form(luo, 'active', 'infinitive', '1st perfect', 'λελυκέναι')

    set_verb_form(luo, 'active', 'participle', '1st aorist',
                  [['λύ̄σᾱς', 'λύ̄σᾱσα', 'λῦσαν'],
                   ['λύ̄σαντος', 'λῡσά̄σης', 'λύ̄σαντος'],
                   ['λύ̄σαντι', 'λῡσά̄σῃ', 'λύ̄σαντι'],
                   ['λύ̄σαντα', 'λύ̄σᾱσαν', 'λῦσαν'],
                   ['λύ̄σᾱς', 'λύ̄σᾱσα', 'λῦσαν'],
                   ['λύ̄σαντε', 'λῡσά̄σᾱ', 'λύ̄σαντε'],
                   ['λῡσάντοιν', 'λῡσά̄σαιν', 'λῡσάντοιν'],
                   ['λύ̄σαντες', 'λύ̄σᾱσαι', 'λύ̄σαντα'],
                   ['λῡσάντων', 'λῡσᾱσῶν', 'λῡσάντων'],
                   ['λύ̄σᾱσι(ν)', 'λῡσά̄σαις', 'λύ̄σᾱσι(ν)'],
                   ['λύ̄σαντας', 'λῡσά̄σας', 'λύ̄σαντα']])

    set_verb_form(luo, 'active', 'participle', '1st aorist',
                  [['λελυκώς', 'λελυκυῖα', 'λελυκός'],
                   ['λελυκότος', 'λελυκυίᾱς', 'λελυκότος'],
                   ['λελυκότι', 'λελυκυίᾳ', 'λελυκότι'],
                   ['λελυκότα', 'λελυκυῖαν', 'λελυκός'],
                   ['λελυκώς', 'λελυκυῖα', 'λελυκός'],
                   ['λελυκότε', 'λελυκυίᾱ', 'λελυκότε'],
                   ['λελυκότοιν', 'λελυκυίαιν', 'λελυκότοιν'],
                   ['λελυκότες', 'λελυκυῖαι', 'λελυκότα'],
                   ['λελυκότων', 'λελυκυλῶν', 'λελυκότων'],
                   ['λελυκόσι(ν)', 'λελυκυίαις', 'λελυκόσι(ν)'],
                   ['λελυκότας', 'λελυκυίᾱς', 'λελυκότα']])

    # Middle

    set_verb_form(luo, 'middle', 'indicative', 'present',
                  ['λύ̄ομαι', 'λύ̄ῃ / λύ̄ει', 'λύ̄εται', 'λύ̄εσθον',
                   'λύ̄εσθον', 'λῡόμεθα', 'λύ̄εσθε', 'λύ̄ονται'])

    set_verb_form(luo, 'middle', 'indicative', 'imperfect',
                  ['ἐλῡόμην', 'ἐλύ̄ου', 'ἐλύ̄ετο', 'ἐλύ̄εσθον', 'ἐλῡέσθην',
                   'ἐλῡόμεθα', 'ἐλύ̄εσθε', 'ἐλύ̄οντο'])

    set_verb_form(luo, 'middle', 'indicative', 'future',
                  ['λύ̄σομαι', 'λύ̄σῃ / λύ̄σει', 'λύ̄σεται', 'λύ̄σεσθον',
                   'λύ̄σεσθον', 'λῡσόμεθα', 'λύ̄σεσθε', 'λύ̄σονται'])

    set_verb_form(luo, 'middle', 'subjunctive', 'present',
                  ['λύ̄ωμαι', 'λύ̄ῃ', 'λύ̄ηται', 'λύ̄ησθον', 'λύ̄ησθον',
                   'λῡώμεθα', 'λύ̄ησθε', 'λύ̄ωνται'])

    set_verb_form(luo, 'middle', 'optative', 'present',
                  ['λῡοίμην', 'λύ̄οιο', 'λύ̄οιτο', 'λύ̄οισθον', 'λῡοίσθην',
                   'λῡοίμεθα', 'λύ̄οισθε', 'λύ̄οιντο'])

    set_verb_form(luo, 'middle', 'optative', 'future',
                  ['λῡσοίμην', 'λύ̄σοιο', 'λύ̄σοιτο', 'λύ̄σοισθον',
                   'λῡσοίσθην', 'λῡσοίμεθα', 'λύ̄σοισθε', 'λύ̄σοιντο'])

    set_verb_form(luo, 'middle', 'imperative', 'present',
                  ['', 'λύ̄ου', 'λῡέσθω', 'λύ̄εσθον', 'λῡέσθων', '', 'λύ̄εσθε',
                   'λῡέσθων'])

    set_verb_form(luo, 'middle', 'infinitive', 'present', 'λύ̄εσθαι')
    set_verb_form(luo, 'middle', 'infinitive', 'future', 'λύ̄σεσθαι')

    set_verb_form(luo, 'middle', 'participle', 'present',
                  [['λῡόμενος', 'λῡομένη', 'λῡόμενον'],
                   ['λῡομένου', 'λῡομένης', 'λῡομένου'],
                   ['λῡομένῳ', 'λῡομένῃ', 'λῡομένῳ'],
                   ['λῡόμενον', 'λῡομένην', 'λῡόμενον'],
                   ['λῡόμενε', 'λῡομένη', 'λῡόμενον'],
                   ['λῡομένω', 'λῡομένᾱ', 'λῡομένω'],
                   ['λῡομένοιν', 'λῡομέναιν', 'λῡομένοιν'],
                   ['λῡόμενοι', 'λῡόμεναι', 'λῡόμενα'],
                   ['λῡομένων', 'λῡομένων', 'λῡομένων'],
                   ['λῡομένοις', 'λῡομέναις', 'λῡομένοις'],
                   ['λῡομένους', 'λῡομένᾱς', 'λῡόμενα']])

    set_verb_form(luo, 'middle', 'participle', 'future',
                  [['λῡσόμενος', 'λῡσομένη', 'λῡσόμενον'],
                   ['λῡσομένου', 'λῡσομένης', 'λῡσομένου'],
                   ['λῡσομένῳ', 'λῡσομένῃ', 'λῡσομένῳ'],
                   ['λῡσόμενον', 'λῡσομένην', 'λῡσόμενον'],
                   ['λῡσόμενε', 'λῡσομένη', 'λῡσόμενον'],
                   ['λῡσομένω', 'λῡσομένᾱ', 'λῡσομένω'],
                   ['λῡσομένοιν', 'λῡσομέναιν', 'λῡσομένοιν'],
                   ['λῡσόμενοι', 'λῡσόμεναι', 'λῡσόμενα'],
                   ['λῡσομένων', 'λῡσομένων', 'λῡσομένων'],
                   ['λῡσομένοις', 'λῡσομέναις', 'λῡσομένοις'],
                   ['λῡσομένους', 'λῡσομένᾱς', 'λῡσόμενα']])

    set_verb_form(luo, 'middle', 'indicative', '1st aorist',
                  ['ἐλῡσάμην', 'ἐλύ̄σω', 'ἐλύ̄σατο', 'ἐλύ̄σασθον', 'ἐλῡσάσθην',
                      'ἐλῡσάμεθα', 'ἐλύ̄σασθε', 'ἐλύ̄σαντο'])

    set_verb_form(luo, 'middle', 'indicative', 'perfect',
                  ['λέλυμαι', 'λέλυσαι', 'λέλυται', 'λέλυσθον', 'λέλυσθον',
                   'λελύμεθα', 'λέλυσθε', 'λέλυνται'])

    set_verb_form(luo, 'middle', 'indicative', 'pluperfect',
                  ['ἐλελύμην', 'ἐλέλυσο', 'ἐλέλυτο', 'ἐλέλυσθον',
                   'ἐλελύσθην', 'ἐλελύμεθα', 'ἐλέλυσθε', 'ἐλέλυντο'])

    set_verb_form(luo, 'middle', 'subjunctive', '1st aorist',
                  ['λύ̄σωμαι', 'λύ̄σῃ', 'λύ̄σηται', 'λύ̄σησθον', 'λύ̄σησθον',
                   'λῡσώμεθα', 'λύ̄σησθε', 'λύ̄σωνται'])

    set_verb_form(luo, 'middle', 'subjunctive', 'perfect',
                  ['λελυμένος ὦ', 'λελυμένος ᾖς', 'λελυμένος ᾖ',
                   'λελυμένω ἦτον', 'λελυμένω ἦτον', 'λελυμένοι ὦμεν',
                   'λελυμένοι ἦτε', 'λελυμένοι ὦσι'])

    set_verb_form(luo, 'middle', 'optative', '1st aorist',
                  ['λῡσαίμην', 'λύ̄σαιο', 'λύ̄σαιτο', 'λύ̄σαισθον',
                   'λῡσαίσθην', 'λῡσαίμεθα', 'λύ̄σαισθε', 'λύ̄σαιντο'])

    set_verb_form(luo, 'middle', 'optative', 'perfect',
                  ['λελυμένος εἴην', 'λελυμένος εἴης', 'λελυμένος εἴη',
                   'λελυμένω εἴητον / λελυμένω εἶτον',
                   'λελυμένω εἰήτην / λελυμένω εἴτην',
                   'λελυμένοι εἴημεν / λελυμένοι εἶμεν',
                   'λελυμένοι εἴητε / λελυμένοι εἶτε',
                   'λελυμένοι εἴησαν / λελυμένοι εἶεν'])

    set_verb_form(luo, 'middle', 'imperative', '1st aorist',
                  ['', 'λῦσαι', 'λῡσάσθω', 'λύ̄σασθον', 'λῡσάσθων', '',
                   'λύ̄σασθε', 'λῡσάσθων'])

    set_verb_form(luo, 'middle', 'imperative', 'perfect',
                  ['', 'λέλυσο', 'λελύσθω', 'λέλυσθον', 'λελύσθων', '',
                   'λέλυσθε', 'λελύσθων'])

    set_verb_form(luo, 'middle', 'infinitive', '1st aorist', 'λύ̄σασθαι')
    set_verb_form(luo, 'middle', 'infinitive', 'perfect', 'λελύσθαι')

    set_verb_form(luo, 'middle', 'participle', '1st aorist',
                  [['λῡσάμενος', 'λῡσαμένη', 'λῡσάμενον'],
                   ['λῡσαμένου', 'λῡσαμένης', 'λῡσαμένου'],
                   ['λῡσαμένῳ', 'λῡσαμένῃ', 'λῡσαμένῳ'],
                   ['λῡσάμενον', 'λῡσαμένην', 'λῡσάμενον'],
                   ['λῡσάμενε', 'λῡσαμένη', 'λῡσάμενον'],
                   ['λῡσαμένω', 'λῡσαμένᾱ', 'λῡσαμένω'],
                   ['λῡσαμένοιν', 'λῡσαμέναιν', 'λῡσαμένοιν'],
                   ['λῡσάμενοι', 'λῡσάμεναι', 'λῡσάμενα'],
                   ['λῡσαμένων', 'λῡσαμένων', 'λῡσαμένων'],
                   ['λῡσαμένοις', 'λῡσαμέναις', 'λῡσαμένοις'],
                   ['λῡσαμένους', 'λῡσαμένᾱς', 'λῡσάμενα']])

    set_verb_form(luo, 'middle', 'participle', 'perfect',
                  [['λελῡομένος', 'λελῡομένη', 'λελῡομενον'],
                   ['λελῡομένου', 'λελῡομένης', 'λελῡομένου'],
                   ['λελῡομένῳ', 'λελῡομένῃ', 'λελῡομένῳ'],
                   ['λελῡομένον', 'λελῡομένην', 'λελῡομενον'],
                   ['λελῡομένε', 'λελῡομένη', 'λελῡομενον'],
                   ['λελῡομένω', 'λελῡομένᾱ', 'λελῡομένω'],
                   ['λελῡομένοιν', 'λελῡομέναιν', 'λελῡομένοιν'],
                   ['λελῡομένοι', 'λελῡομεναι', 'λελῡομενα'],
                   ['λελῡομένων', 'λελῡομένων', 'λελῡομένων'],
                   ['λελῡομένοις', 'λελῡομέναις', 'λελῡομένοις'],
                   ['λελῡομένους', 'λελῡομένᾱς', 'λελῡόμενα']])

    # Passive
    set_verb_form(luo, 'passive', 'indicative', 'future perfect',
                  ['λελύ̄σομαι', 'λελύ̄σῃ / λελύ̄σει', 'λελύ̄σεται',
                   'λελύ̄σεσθον', 'λελύ̄σεσθον', 'λελῡσόμεθα', 'λελύ̄σεσθε',
                   'λελύ̄σονται'])

    set_verb_form(luo, 'passive', 'indicative', '1st aorist',
                  ['ἐλύθην', 'ἐλύθης', 'ἐλύθη', 'ἐλύθητον', 'ἐλυθήτην',
                   'ἐλύθημεν', 'ἐλύθητε', 'ἐλύθησαν'])

    set_verb_form(luo, 'passive', 'indicative', '1st future',
                  ['λυθήσομαι', 'λυθήσῃ / λυθήσει', 'λυθήσεται',
                   'λυθήσεσθον', 'λυθήσεσθον', 'λυθησόμεθα', 'λυθήσεσθε',
                   'λυθήσονται'])

    set_verb_form(luo, 'passive', 'subjunctive', '1st aorist',
                  ['λυθῶ', 'λυθῇς', 'λυθῇ', 'λυθῆτον', 'λυθῆτον',
                   'λυθῶμεν', 'λυθῆτε', 'λυθῶσι'])

    set_verb_form(luo, 'passive', 'optative', 'future perfect',
                  ['λελῡσοίμην', 'λελύ̄σοιο', 'λελύ̄σοιτο', 'λελύ̄σοισθον',
                   'λελῡσοίσθην', 'λελῡσοίμεθα', 'λελύ̄σοισθε', 'λελύ̄σοιντο'])

    set_verb_form(luo, 'passive', 'optative', '1st aorist',
                  ['λυθείην', 'λυθείης', 'λυθείη', 'λυθεῖτον / λυθείητον',
                   'λυθείτην / λυθειήτην', 'λυθεῖμεν / λυθείημεν',
                   'λυθεῖτε / λυθείητε', 'λυθεῖεν / λυθείησαν'])

    set_verb_form(luo, 'passive', 'optative', '1st future',
                  ['λυθησοίμην', 'λυθήσοιο', 'λυθήσοιτο', 'λυθήσοισθον',
                   'λυθησοίσθην', 'λυθησοίμεθα', 'λυθήσοισθε', 'λυθήσοιντο'])

    set_verb_form(luo, 'passive', 'imperative', '1st aorist',
                  ['', 'λύθητι', 'λυθήτω', 'λύθητον', 'λυθήτων', '',
                   'λύθητε', 'λυθέντων'])

    set_verb_form(luo, 'passive', 'infinitive', 'future perfect',
                  'λελύ̄σεσθαι')
    set_verb_form(luo, 'passive', 'infinitive', '1st aorist', 'λυθῆναι')
    set_verb_form(luo, 'passive', 'infinitive', '1st perfect', 'λυθήσεσθαι')

    set_verb_form(luo, 'passive', 'participle', 'future perfect',
                  [['λελῡσόμενος', 'λελῡσομένη', 'λελῡσόμενον'],
                   ['λελῡσομένου', 'λελῡσομένης', 'λελῡσομένου'],
                   ['λελῡσομένῳ', 'λελῡσομένῃ', 'λελῡσομένῳ'],
                   ['λελῡσόμενον', 'λελῡσομένην', 'λελῡσόμενον'],
                   ['λελῡσόμενε', 'λελῡσομένη', 'λελῡσόμενον'],
                   ['λελῡσομένω', 'λελῡσομένᾱ', 'λελῡσομένω'],
                   ['λελῡσομένοιν', 'λελῡσομέναιν', 'λελῡσομένοιν'],
                   ['λελῡσόμενοι', 'λελῡσόμεναι', 'λελῡσόμενα'],
                   ['λελῡσομένων', 'λελῡσομένων', 'λελῡσομένων'],
                   ['λελῡσομένοις', 'λελῡσομέναις', 'λελῡσομένοις'],
                   ['λελῡσομένους', 'λελῡσομένᾱς', 'λελῡσόμενα']])

    set_verb_form(luo, 'passive', 'participle', '1st aorist',
                  [['λυθείς', 'λυθεῖσα', 'λυθέν'],
                   ['λυθέντος', 'λυθείσης', 'λυθέντος'],
                   ['λυθένλυ', 'λυθείσῃ', 'λυθένλυ'],
                   ['λυθέντα', 'λυθεῖσαν', 'λυθέν'],
                   ['λυθείς', 'λυθεῖσα', 'λυθέν'],
                   ['λυθέντε', 'λυθείσᾱ', 'λυθέντε'],
                   ['λυθέντοιν', 'λυθείσαιν', 'λυθέντοιν'],
                   ['λυθέντες', 'λυθεῖσαι', 'λυθέντα'],
                   ['λυθέντων', 'λυθεισῶν', 'λυθέντων'],
                   ['λυθεῖσι(ν)', 'λυθείσαις', 'λυθεῖσι(ν)'],
                   ['λυθέντας', 'λυθείσᾱς', 'λυθέντα']])

    set_verb_form(luo, 'passive', 'participle', '1st future',
                  [['λυθησόμενος', 'λυθησομένη', 'λυθησόμενον'],
                   ['λυθησομένου', 'λυθησομένης', 'λυθησομένου'],
                   ['λυθησομένῳ', 'λυθησομένῃ', 'λυθησομένῳ'],
                   ['λυθησόμενον', 'λυθησομένην', 'λυθησόμενον'],
                   ['λυθησόμενε', 'λυθησομένη', 'λυθησόμενον'],
                   ['λυθησομένω', 'λυθησομένᾱ', 'λυθησομένω'],
                   ['λυθησομένοιν', 'λυθησομέναιν', 'λυθησομένοιν'],
                   ['λυθησόμενοι', 'λυθησόμεναι', 'λυθησόμενα'],
                   ['λυθησομένων', 'λυθησομένων', 'λυθησομένων'],
                   ['λυθησομένοις', 'λυθησομέναις', 'λυθησομένοις'],
                   ['λυθησομένους', 'λυθησομένᾱς', 'λυθησόμενα']])


class VerbList(object):
    pass


def parse_args():
    parser = argparse.ArgumentParser('Verbs')
    parser.add_argument('--get')
    parser.add_argument('--show')
    parser.add_argument('--anki', action='store_true')
    return parser.parse_args()


def download_and_save(word):
    html = anki.get_html_from_wiktionary(word)
    # with open('html.txt', 'w') as ff:
    #     ff.write(html.encode('utf-8'))
    print html


def main():
    args = parse_args()
    if args.get:
        download_and_save(args.get)
    if args.show:
        anki.show_forms(args.show, SHELF)

if __name__ == '__main__':
    prepare_shelf()
    import sys
    sys.exit()
    global SHELF
    SHELF = shelve.open('verbs.shelf')
    main()
    SHELF.close()
